ekranoplan_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          incompressibleFluid;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
  forceCoeffs1
  {
    type forceCoeffs;
    libs ("libforces.so");
    patches (ekranoplan);
    rho rhoInf;
    rhoInf 1.225;
    liftDir (0 0 1);
    dragDir (1 0 0);
    CofR (0 0 0);        // your center of rotation/reference point
    pitchAxis (0 1 0);
    magUInf 30;
    lRef 1.0;             // reference chord
    Aref 1.0;             // reference wing area
  }
}
// ************************************************************************* //
