ekranoplan_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flowVelocity    (20 0 0);

pressure        0;

turbulentKE     0.24;

turbulentOmega  1.78;

dimensions      [velocity];

internalField   uniform (20 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (30 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (30 0 0);
    }

    ekranoplan
    {
        type noSlip;
    }
    sides
    {
        type slip;
    }
    top
    {
        type slip;
    }
    upperWall
    {
        type            symmetryPlane;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
